In [3]:
import pandas as pd 
import numpy as np

### Useful

#### Null 처리
- Nan, Na

In [20]:
# 예제 주식 데이터 생성 
data = { "Date": ["2024-12-11", "2024-12-12", "2024-12-12", "2024-12-13", "2024-12-14", "2024-12-15"], 
        "Open": [150.5, 152.0, 152.0, 155.0, np.nan, 160.0], 
        "High": [155.0, 153.5, 153.5, 158.0, 161.0, np.nan], 
        "Low": [149.0, 151.0, 151.0, 154.5, np.nan, 159.0], 
        "Close": [154.0, 152.5, 152.5, 157.5, 160.5, 152.5], 
        "Volume": [2000, 2500, 2500, 1800, np.nan, 1700] } 
# DataFrame 생성 
df_first = pd.DataFrame(data)
df_first

         Date   Open   High    Low  Close  Volume
0  2024-12-11  150.5  155.0  149.0  154.0  2000.0
1  2024-12-12  152.0  153.5  151.0  152.5  2500.0
2  2024-12-12  152.0  153.5  151.0  152.5  2500.0
3  2024-12-13  155.0  158.0  154.5  157.5  1800.0
4  2024-12-14    NaN  161.0    NaN  160.5     NaN
5  2024-12-15  160.0    NaN  159.0  152.5  1700.0

In [12]:
df_first.shape

(6, 6)

#### 중복 레코드 처리

In [13]:
df_first.drop_duplicates()

         Date   Open   High    Low  Close  Volume
0  2024-12-11  150.5  155.0  149.0  154.0  2000.0
1  2024-12-12  152.0  153.5  151.0  152.5  2500.0
3  2024-12-13  155.0  158.0  154.5  157.5  1800.0
4  2024-12-14    NaN  161.0    NaN  160.5     NaN
5  2024-12-15  160.0  162.0  159.0  152.5  1700.0

In [17]:
df_first.drop_duplicates(subset=["Open","Close"])

         Date   Open   High    Low  Close  Volume
0  2024-12-11  150.5  155.0  149.0  154.0  2000.0
1  2024-12-12  152.0  153.5  151.0  152.5  2500.0
3  2024-12-13  155.0  158.0  154.5  157.5  1800.0
4  2024-12-14    NaN  161.0    NaN  160.5     NaN
5  2024-12-15  160.0  162.0  159.0  152.5  1700.0

In [18]:
df_first.drop_duplicates(subset=["Close"])

         Date   Open   High    Low  Close  Volume
0  2024-12-11  150.5  155.0  149.0  154.0  2000.0
1  2024-12-12  152.0  153.5  151.0  152.5  2500.0
3  2024-12-13  155.0  158.0  154.5  157.5  1800.0
4  2024-12-14    NaN  161.0    NaN  160.5     NaN

#### 삭제

In [21]:
df_first.dropna()

         Date   Open   High    Low  Close  Volume
0  2024-12-11  150.5  155.0  149.0  154.0  2000.0
1  2024-12-12  152.0  153.5  151.0  152.5  2500.0
2  2024-12-12  152.0  153.5  151.0  152.5  2500.0
3  2024-12-13  155.0  158.0  154.5  157.5  1800.0

In [22]:
df_first[['High','Close']].dropna()

    High  Close
0  155.0  154.0
1  153.5  152.5
2  153.5  152.5
3  158.0  157.5
4  161.0  160.5

#### null 확인

In [26]:
df_first.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    6 non-null      object
 1   Open    5 non-null      float64
 2   High    5 non-null      float64
 3   Low     5 non-null      float64
 4   Close   6 non-null      float64
 5   Volume  5 non-null      float64
dtypes: float64(5), object(1)
memory usage: 420.0+ bytes

In [29]:
df_first.isna()

    Date   Open   High    Low  Close  Volume
0  False  False  False  False  False   False
1  False  False  False  False  False   False
2  False  False  False  False  False   False
3  False  False  False  False  False   False
4  False   True  False   True  False    True
5  False  False   True  False  False   False

In [30]:
df_first.isna().sum()

Date      0
Open      1
High      1
Low       1
Close     0
Volume    1
dtype: int64

In [31]:
df_first.isna().sum()['Low']

1

#### 특정 값으로 채우기

In [24]:
df_first.fillna(method='ffill') # 채울 규칙

/tmp/ipykernel_44710/1266665688.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df_first.fillna(method='ffill') # 채울 규칙

         Date   Open   High    Low  Close  Volume
0  2024-12-11  150.5  155.0  149.0  154.0  2000.0
1  2024-12-12  152.0  153.5  151.0  152.5  2500.0
2  2024-12-12  152.0  153.5  151.0  152.5  2500.0
3  2024-12-13  155.0  158.0  154.5  157.5  1800.0
4  2024-12-14  155.0  161.0  154.5  160.5  1800.0
5  2024-12-15  160.0  161.0  159.0  152.5  1700.0

In [25]:
df_first.fillna(method='bfill') # 채울 규칙

/tmp/ipykernel_44710/1225694189.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df_first.fillna(method='bfill') # 채울 규칙

         Date   Open   High    Low  Close  Volume
0  2024-12-11  150.5  155.0  149.0  154.0  2000.0
1  2024-12-12  152.0  153.5  151.0  152.5  2500.0
2  2024-12-12  152.0  153.5  151.0  152.5  2500.0
3  2024-12-13  155.0  158.0  154.5  157.5  1800.0
4  2024-12-14  160.0  161.0  159.0  160.5  1700.0
5  2024-12-15  160.0    NaN  159.0  152.5  1700.0